examples/tobias_tutorial/gin_tonic_cht/templates/system/ginTonic/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  www.openfoam.org                      |
|   \\  /    A nd           | Version:  12                                    |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    //- The air domain is the surrounding domain that we do not consider.
    //  therefore inlet/outlet - not 100 percentage physical but
    //  for demonstration okay
    {
        name            top;
        patchInfo
        {
            type            patch;
        }

        constructFrom patches;
        patches (ginTonic_to_air);
    }

    //- glass we do not consider either -> wall
    {
        name            fixedWalls;
        patchInfo
        {
            type            wall;
        }
        constructFrom patches;
        patches (ginTonic_to_glass);
    }
);

// ************************************************************************* //
